In [1]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [2]:
data = { "city": ["Leeds", "Leeds", "Leeds", "York", "York"],
        "year": ["2010", "2011", "2012", "2011", "2012"],
        "pop": ["435", "474", "480", "154", "158"] }
frame = DataFrame(data)
frame

    city  pop  year
0  Leeds  435  2010
1  Leeds  474  2011
2  Leeds  480  2012
3   York  154  2011
4   York  158  2012

In [3]:
DataFrame(data, columns=["year", "city", "pop"])

   year   city  pop
0  2010  Leeds  435
1  2011  Leeds  474
2  2012  Leeds  480
3  2011   York  154
4  2012   York  158

In [4]:
frame2 = DataFrame(data, columns=["year", "city", "pop", "debt"],
                   index=["one", "two", "three", "four", "five"])
frame2

       year   city  pop debt
one    2010  Leeds  435  NaN
two    2011  Leeds  474  NaN
three  2012  Leeds  480  NaN
four   2011   York  154  NaN
five   2012   York  158  NaN

In [5]:
frame2.columns

Index(['year', 'city', 'pop', 'debt'], dtype='object')

In [6]:
frame["city"]

0    Leeds
1    Leeds
2    Leeds
3     York
4     York
Name: city, dtype: object

In [7]:
frame2.year

one      2010
two      2011
three    2012
four     2011
five     2012
Name: year, dtype: object

---

Notice that the magic which provides the "attribute" version of obtaining a column breaks down for already existing methods:

In [8]:
frame.pop

<bound method NDFrame.pop of     city  pop  year
0  Leeds  435  2010
1  Leeds  474  2011
2  Leeds  480  2012
3   York  154  2011
4   York  158  2012>

---

In [9]:
frame2.ix["three"]

year     2012
city    Leeds
pop       480
debt      NaN
Name: three, dtype: object

In [10]:
frame2["debt"] = 16
frame2

       year   city  pop  debt
one    2010  Leeds  435    16
two    2011  Leeds  474    16
three  2012  Leeds  480    16
four   2011   York  154    16
five   2012   York  158    16

In [11]:
frame2["debt"] = np.arange(5)
frame2

       year   city  pop  debt
one    2010  Leeds  435     0
two    2011  Leeds  474     1
three  2012  Leeds  480     2
four   2011   York  154     3
five   2012   York  158     4

In [12]:
val = Series([-1.2, -1.5, -2], index=["two", "five", "one"])
frame2["debt"] = val
frame2

       year   city  pop  debt
one    2010  Leeds  435  -2.0
two    2011  Leeds  474  -1.2
three  2012  Leeds  480   NaN
four   2011   York  154   NaN
five   2012   York  158  -1.5

In [13]:
frame2["West Yorkshire"] = frame2.city == "Leeds"
frame2

       year   city  pop  debt West Yorkshire
one    2010  Leeds  435  -2.0           True
two    2011  Leeds  474  -1.2           True
three  2012  Leeds  480   NaN           True
four   2011   York  154   NaN          False
five   2012   York  158  -1.5          False

In [14]:
del frame2["West Yorkshire"]
frame2.columns

Index(['year', 'city', 'pop', 'debt'], dtype='object')

You can also initialise a `DataFrame` from a nest dictionary structure

In [18]:
pop = { "Leeds" : {2010:435, 2011:474, 2012:480}, "York":{2011:154, 2012:158}}
frame3 = DataFrame(pop)
frame3

      Leeds   York
2010    435    NaN
2011    474  154.0
2012    480  158.0

In [19]:
frame3.T

        2010   2011   2012
Leeds  435.0  474.0  480.0
York     NaN  154.0  158.0

In [20]:
DataFrame(pop, index=[2012, 2010, 2011])

      Leeds   York
2012    480  158.0
2010    435    NaN
2011    474  154.0

In [22]:
leeds = Series([435,474,480], index=[2010,2011,2012])
york = Series([154,158], index=[2011,2012])
DataFrame({"Leeds":leeds, "York":york})

      Leeds   York
2010    435    NaN
2011    474  154.0
2012    480  158.0

In [23]:
frame3.index.name="year"
frame3.columns.name="city"
frame3

city  Leeds   York
year
2010    435    NaN
2011    474  154.0
2012    480  158.0

In [24]:
frame3.values

array([[ 435.,   nan],
       [ 474.,  154.],
       [ 480.,  158.]])

In [25]:
frame2.values

array([['2010', 'Leeds', '435', -2.0],
       ['2011', 'Leeds', '474', -1.2],
       ['2012', 'Leeds', '480', nan],
       ['2011', 'York', '154', nan],
       ['2012', 'York', '158', -1.5]], dtype=object)